let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems })  => {
const caption =`
『𝑮𝒐𝒌𝒖🇾🇪🫀🇵🇸』
*· · • • • • ✦ • • • • · ·*
*⌬ ❛╏ اهلا,* ${name}⁩
*⌬ ❛╏ الوقت:${wib}
*⌬ ❛╏ التاريخ:${date}
*⌬ ❛╏ المستخدمين:${rtotal}
*⌬ ❛╏ المنصه ⩾ 𝐻𝐸𝑅𝛩𝐾𝑈
*· · • • • • ✦ • • • • · ·*
*₪↲ معلومات المطور ┆⥌❄️⥍*
*⌬ ❛╏𝜜𝑴𝑹𝑶 𝑲𝑯𝜜𝑳𝑰𝑫🇵🇸🫀🇾🇪╏❛ ⌬* *اسم المطور*

*⌬ ❛╏𝑮𝒐𝒌𝒖╏❛ ⌬* *لقب المطور* 

*⌬ ❛╏https://wa.me/+967774318278 ╏❛ ⌬* ‬‏*رقم المطور

*⌬ ❛╏ ⌬* *جروب المطور*
https://chat.whatsapp.com/EbzeqqSjqsMI2oDrjSdT3g
*⌬ ❛╏ ⌬* *جروب دعم المطور*
  ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ info sc owner :
 -----------------------------
  ⌬ | *𝚈𝙾𝚄𝚃𝚄𝙱𝙴*:https://www.youtube.com/@user-to2qq1ji1r
  ⌬ | *𝙸𝙽𝚂𝚃𝙰𝙶𝚁𝙰𝙼*:https://www.instagram.com/mrwbryh?igsh=MWxwZ2o4N2NkMHN5YQ==
  ----------------------------- 
`


await conn.sendMessage( m.chat, {
        video: {
          url: 'https://telegra.ph/file/eeb2e29a434b5dad1a36d.mp4'
        },
        caption: caption,
        gifPlayback: true,
        gifAttribution: Math.floor( Math.random( ) * 2 ) + 1
      }, {
        quoted: m
      } );
}

handler.help = ['allmenu']
handler.tags = ['main']
handler.command = ['الصانع'] 
export default handler
